IDEA StatiCa Open Model
ReinfAroundOpening.DiagonalDiameter Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Diameter of diagonal reinforcement
 Namespace: IdeaRS.OpenModel.Detail
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public double DiagonalDiameter { get; set; }
Public Property DiagonalDiameter As Double
	Get
	Set
public:
property double DiagonalDiameter {
	double get ();
	void set (double value);
}
Property Value
Type: Double
See Also
Reference
ReinfAroundOpening Class
IdeaRS.OpenModel.Detail Namespace